InformationRegisters/ОтветыНаЗапросыИОН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветыНаЗапросыИОН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСодержимогоФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветыНаЗапросыИОН/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите строку'"));
		Возврат; 
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура("Запрос, ИмяФайла, ТипСодержимого");
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеДанные);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"КомандаЗагрузить_ПослеВыбораФайла", 
		ЭтотОбъект, 
		ДанныеСтроки);
		
	ОперацииСФайламиЭДКОКлиент.ДобавитьФайлы(ОписаниеОповещения, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаЗагрузить_ПослеВыбораФайла(Результат, ДанныеСтроки) Экспорт
	
	Если НЕ Результат.Выполнено	Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияФайлов = Результат.ОписанияФайлов;
	
	Для каждого ОписаниеФайла Из ОписанияФайлов Цикл
		ЗагрузитьФайлыНаСервере(ОписаниеФайла.Адрес, ДанныеСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьФайлыНаСервере(Адрес, ДанныеСтроки)
	
	ДвДанные = ПолучитьИзВременногоХранилища(Адрес);
		
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ДобавитьОтветНаЗапросИОН(
		ДанныеСтроки.Запрос, 
		ДанныеСтроки.ИмяФайла, 
		ДвДанные,
		ДвДанные.Размер(),
		ДанныеСтроки.ТипСодержимого);

	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Готово'")); 
	
КонецПроцедуры

#КонецОбласти
